{
  "nodes": [
    {
      "op": "null", 
      "name": "input_labels", 
      "attrs": {"__shape__": "(11776, 1)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "input_states", 
      "attrs": {"__shape__": "(11776, 9, 15, 15)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv1_bn", 
      "inputs": [[4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 1], [8, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv1_act", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv2_bn", 
      "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0], [16, 0, 1], [17, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv2_act", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv3_bn", 
      "inputs": [[22, 0, 0], [23, 0, 0], [24, 0, 0], [25, 0, 1], [26, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv3_act", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[28, 0, 0], [29, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv4_bn", 
      "inputs": [[31, 0, 0], [32, 0, 0], [33, 0, 0], [34, 0, 1], [35, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv4_act", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv5", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[37, 0, 0], [38, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv5_bn", 
      "inputs": [[40, 0, 0], [41, 0, 0], [42, 0, 0], [43, 0, 1], [44, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv5_act", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_final_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_final_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_final", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[46, 0, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_final_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_final_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_final_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_final_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv_final_bn", 
      "inputs": [[49, 0, 0], [50, 0, 0], [51, 0, 0], [52, 0, 1], [53, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv_final_act", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[54, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_2_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2_1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_2_1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "2", 
        "pad": "(0, 0)"
      }, 
      "inputs": [[55, 0, 0], [56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_2_1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2_1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2_1_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2_1_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv3_2_1_bn", 
      "inputs": [[58, 0, 0], [59, 0, 0], [60, 0, 0], [61, 0, 1], [62, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv3_2_1_act", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[63, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten1", 
      "inputs": [[64, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout1", 
      "attrs": {"p": "0.5"}, 
      "inputs": [[65, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc_3_2_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc_3_2_1_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc_3_2_1", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": [[66, 0, 0], [67, 0, 0], [68, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation0", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[69, 0, 0]]
    }, 
    {
      "op": "elemwise_sub", 
      "name": "_minus0", 
      "inputs": [[0, 0, 0], [70, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square0", 
      "inputs": [[71, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean1", 
      "inputs": [[72, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_1_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_1_1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "4", 
        "pad": "(0, 0)"
      }, 
      "inputs": [[55, 0, 0], [74, 0, 0], [75, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_1_1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_1_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_1_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv3_1_1_bn", 
      "inputs": [[76, 0, 0], [77, 0, 0], [78, 0, 0], [79, 0, 1], [80, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv3_1_1_act", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten0", 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout0", 
      "attrs": {"p": "0.5"}, 
      "inputs": [[83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc_3_1_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc_3_1_1_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc_3_1_1", 
      "attrs": {"num_hidden": "225"}, 
      "inputs": [[84, 0, 0], [85, 0, 0], [86, 0, 0]]
    }, 
    {
      "op": "SoftmaxActivation", 
      "name": "softmaxactivation0", 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "log", 
      "name": "log0", 
      "inputs": [[88, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mcts_probs", 
      "attrs": {"__shape__": "(11776, 225)"}, 
      "inputs": []
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul0", 
      "inputs": [[89, 0, 0], [90, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum0", 
      "attrs": {"axis": "1"}, 
      "inputs": [[91, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar0", 
      "attrs": {"scalar": "-1.0"}, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean0", 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[73, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "MakeLoss", 
      "name": "makeloss0", 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar1", 
      "attrs": {"scalar": "-1.0"}, 
      "inputs": [[88, 0, 0]]
    }, 
    {
      "op": "log", 
      "name": "log1", 
      "inputs": [[88, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul1", 
      "inputs": [[97, 0, 0], [98, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum1", 
      "attrs": {"axis": "1"}, 
      "inputs": [[99, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean2", 
      "inputs": [[100, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad0", 
      "inputs": [[101, 0, 0]]
    }, 
    {
      "op": "MakeLoss", 
      "name": "makeloss1", 
      "inputs": [[102, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    3, 
    5, 
    6, 
    7, 
    8, 
    11, 
    12, 
    14, 
    15, 
    16, 
    17, 
    20, 
    21, 
    23, 
    24, 
    25, 
    26, 
    29, 
    30, 
    32, 
    33, 
    34, 
    35, 
    38, 
    39, 
    41, 
    42, 
    43, 
    44, 
    47, 
    48, 
    50, 
    51, 
    52, 
    53, 
    56, 
    57, 
    59, 
    60, 
    61, 
    62, 
    67, 
    68, 
    74, 
    75, 
    77, 
    78, 
    79, 
    80, 
    85, 
    86, 
    90
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    78, 
    79, 
    80, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93, 
    94, 
    95, 
    96, 
    99, 
    100, 
    101, 
    103, 
    104, 
    105, 
    106, 
    107, 
    108, 
    109, 
    110, 
    111, 
    112, 
    113, 
    114, 
    115, 
    116, 
    117, 
    118, 
    119, 
    120, 
    121, 
    122
  ], 
  "heads": [[96, 0, 0], [103, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10100]}
}